---
kind: property
id: P:Autodesk.Revit.DB.ViewSheetSetting.InSession
source: html/499cf452-867e-e131-b39d-493875215872.htm
---
# Autodesk.Revit.DB.ViewSheetSetting.InSession Property

The in-session view sheet set of Print Setup.

## Syntax (C#)
```csharp
public InSessionViewSheetSet InSession { get; }
```